// типы данных
// String - тип данных для текста 
// Number - тип данных для чисел 
// Boolean - тип данных для логических значений (true/false)
// null - специальное значение, которое означает "отсутствие значения" 
// undefined - тип данных который озночает что переменная не была инициализерованна 
// Object - тип данных для обектов которые  могкт содержать свойства и методы
// BigInt - тип данных для больших цель 
// Symbol - тип данных для уникальных идентификаторов


// let str = "hello word"
// console.log( typeof str)


// let a = "234567890";
// console. log( typeof a)

// let a = 234567890;
// console. log( typeof a)



//условные операторы
// if (условие) {
     // код который выполниться если условные истинно

//  } else {
//       // код который выполнться если условные ложно
//  }




let age = prompt ("введите ваш возраст")
if(age <= 15) {
    alert("Салам балакай")
} else  if (age > 15 && age <=30){
  alert("Салам жигит")  
 } else  if (age > 15 && age <=30){
  alert("салам байке")  
} else  if (age > 30 && age <=50){
  alert("салам ата")  
} else  if (age > 50 && age <=70){
  alert("салам чон ата")  
} else  if (age > 70 && age <=100){
  alert("ушундай да жаш болобу")  
}



